---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipingSystemType.TwoLineDropType
source: html/c0cba738-7ef5-d6fe-589a-7006d899b9f5.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystemType.TwoLineDropType Property

Symbol for a 2 line drop

## Syntax (C#)
```csharp
public RiseDropSymbol TwoLineDropType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input is not a valid piping rise/drop symbol type.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration